src/DataProcessors/witsml_Обработки/witsml_Обработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>witsml_Обработки</name>
  <attributes>
    <name>МоментВремени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/witsml_UnitConversionType/witsml_UnitConversionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>witsml_UnitConversionType</name>
  <enumValues>
    <name>fraction</name>
  </enumValues>
  <enumValues>
    <name>factor</name>
  </enumValues>
  <enumValues>
    <name>formula</name>
  </enumValues>
</mdclass:Enum>

src/Enums/witsml_UnitType/witsml_UnitType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>witsml_UnitType</name>
  <enumValues>
    <name>BaseUnits</name>
  </enumValues>
  <enumValues>
    <name>DerivedUnits</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/witsml_RealtimeData/witsml_RealtimeData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>witsml_RealtimeData</name>
  <comment>These values represent the name of a recording channel.</comment>
  <attributes>
    <name>Descriptions</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/witsml_Units/witsml_Units.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>witsml_Units</name>
  <attributes>
    <name>UnitType</name>
    <type>
      <types>EnumRef.witsml_UnitType</types>
    </type>
  </attributes>
  <attributes>
    <name>UnitConversionType</name>
    <type>
      <types>EnumRef.witsml_UnitConversionType</types>
    </type>
  </attributes>
  <attributes>
    <name>Descriptions</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseUnit</name>
    <type>
      <types>CatalogRef.witsml_Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Conversion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Origin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/witsml_Обработки/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСправочникwitsml_RealtimeData(Команда)
	ЗаполнитьСправочникwitsml_RealtimeDataНаСервере();
КонецПроцедуры  // ЗаполнитьСправочникwitsml_RealtimeData(Команда)

&НаСервере
Процедура ЗаполнитьСправочникwitsml_RealtimeDataНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;    

	Макет = Справочники.witsml_RealtimeData.ПолучитьМакет("Data");
	
	ОбластьДанных = Макет.Область(1, 1, Макет.ВысотаТаблицы, Макет.ШиринаТаблицы); 
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьДанных);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	Выборка = ПостроительОтчета.Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		s_Name         = СокрЛП(Выборка.Name); 
		s_Descriptions = СокрЛП(Выборка.Description); 
		s_Status       = СокрЛП(Выборка.Status);
		
		СпрСсылка = Справочники.witsml_RealtimeData.НайтиПоНаименованию(s_Name, Истина);
		Если Не ЗначениеЗаполнено(СпрСсылка) Тогда
			СпрОбъект = Справочники.witsml_RealtimeData.СоздатьЭлемент();
			СпрОбъект.Наименование = s_Name;
		Иначе
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		СпрОбъект.Descriptions = s_Descriptions;
		СпрОбъект.Status       = Перечисления.witsml_Statuses[s_Status];
		
		СпрОбъект.Записать();
		
	КонецЦикла;  // Пока Выборка.Следующий() Цикл
	
КонецПроцедуры  // ЗаполнитьСправочникwitsml_RealtimeDataНаСервере()

&НаСервере
Процедура ЗаполнитьСправочникwitsml_UnitsНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;    

	Макет = Справочники.witsml_Units.ПолучитьМакет("Data");
	
	ОбластьДанных = Макет.Область(1, 1, Макет.ВысотаТаблицы, Макет.ШиринаТаблицы); 
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьДанных);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	Выборка = ПостроительОтчета.Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//Type					-> UnitType				(ПеречислениеСсылка.witsml_UnitType)
		//Name					-> Наименование			(Строка)
		//Annotation			-> Код					(Строка)
		//Base unit				-> BaseUnit				(СправочникСсылка.witsml_Units) 
		//UnitConversionType	-> UnitConversionType	(ПеречислениеСсылка.witsml_UnitConversionType)	
		//Conversion			-> Conversion			(Строка)
		//Description			-> Descriptions			(Строка)
		//Origin				-> Origin				(Строка)
		
		s_Type               = СокрЛП(Выборка.Type); 
		s_Name               = СокрЛП(Выборка.Name); 
		s_Annotation         = СокрЛП(Выборка.Annotation); 
		s_BaseUnit           = СокрЛП(Выборка.BaseUnit); 
		s_UnitConversionType = СокрЛП(Выборка.UnitConversionType); 
		s_Conversion         = СокрЛП(Выборка.Conversion); 
		s_Description        = СокрЛП(Выборка.Description); 
		s_Origin             = СокрЛП(Выборка.Origin); 
		
		СпрСсылка = Справочники.witsml_Units.GetByAnnotation(s_Annotation);
		
		Если Не ЗначениеЗаполнено(СпрСсылка) Тогда
			СпрОбъект = Справочники.witsml_Units.СоздатьЭлемент();
			СпрОбъект.Код = s_Annotation;
		Иначе
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		UnitConversionType = Перечисления.witsml_UnitConversionType.ПустаяСсылка();
		Если      s_UnitConversionType = "Conversion (fraction)" Тогда
			UnitConversionType = Перечисления.witsml_UnitConversionType.fraction;
		ИначеЕсли s_UnitConversionType = "Conversion (factor)" Тогда
			UnitConversionType = Перечисления.witsml_UnitConversionType.factor;
		ИначеЕсли s_UnitConversionType = "Conversion (formula)" Тогда
			UnitConversionType = Перечисления.witsml_UnitConversionType.formula;
		КонецЕсли;
		
		СпрОбъект.UnitType           = ?(s_Type = "Base Units", Перечисления.witsml_UnitType.BaseUnits, Перечисления.witsml_UnitType.DerivedUnits);
		СпрОбъект.Наименование       = s_Name;
		СпрОбъект.BaseUnit           = Справочники.witsml_Units.GetByAnnotation(s_BaseUnit);
		СпрОбъект.UnitConversionType = UnitConversionType;
		СпрОбъект.Conversion         = s_Conversion;
		СпрОбъект.Descriptions       = s_Description;
		СпрОбъект.Origin             = s_Origin;
		
		СпрОбъект.Записать();
		
	КонецЦикла;  // Пока Выборка.Следующий() Цикл
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСправочникwitsml_Units(Команда)
	ЗаполнитьСправочникwitsml_UnitsНаСервере();
КонецПроцедуры
